url = 




keys_44fz = [
        'Способ определения поставщика (подрядчика, исполнителя)',
        'Размещение осуществляет',
        'Сведения о связи с позицией плана-графика',
        'Начальная (максимальная) цена контракта',
        'Место доставки товара, выполнения работы или оказания услуги',
        'Сроки поставки товара или завершения работы либо график оказания услуг',
        'Размер обеспечения исполнения контракта',
# документы - все ссылки на странице находятся в классе ' attachment' class displayTable
# Результаты определения поставщика - название победитенля и его организационно правовая форма
# Журнал событий - Дата извещения о проведении аукциона
]
key_185fz = [
# Общая информация
        'Способ определения поставщика (подрядчика, исполнителя, подрядной организации)',
        'Наименование закупки',
        'Наименование организации',
        'Начальная (максимальная) цена договора, рублей',
        'Размер обеспечения исполнения обязательств по договору',
        'Сроки выполнения работ и (или) оказания услуг',
# Документы - ?????????????????? уточнить, наверное надо скачать
# журнал событий - последнюю дату (Дата извещения о проведении закупки) 
]
key_223fz = [
        'Способы размещения закупки',
        'Наименование закупки',
        'Наименование организации',
# Список лотов
        'Начальная (максимальная) цена дороговора:',
# Документы извещения - нужны все ссылки
# Протоколы - нужны все ссылки
# Об 

        ]
site_doc = 



http://www.zakupki.gov.ru/epz/order/notice/ea44/view/common-info.html       ?regNumber=0334300027618000126
http://www.zakupki.gov.ru/epz/order/notice/ea44/view/documents.html         ?regNumber=0334300027618000126
http://www.zakupki.gov.ru/epz/order/notice/ea44/view/supplier-results.html  ?regNumber=0334300027618000126
http://www.zakupki.gov.ru/epz/order/notice/ea44/view/event-journal.html     ?regNumber=0334300027618000126