all_news = [
        {
            'id': 1,
            'title': 'Илон Маск обвинен в мошенничестве: его заявления нанесли ущерб инвесторам',
            'text': 'Комиссия по ценным бумагам и биржам США(SEC) обвинила основателя Tesla Илона Маска в мошенничестве в связи с его заявлениями о намерениях сделать компанию непубличной. Регулятор утверждает, что Маск ничего не сделал для того, чтобы увести компанию с биржи. SEC назвала его заявления ложными и вводящими в заблуждение и обратилась с иском в федеральный окружной суд Манхэттена. "По факту Маск даже не обсуждал, а тем более не подтверждал ключевые условия сделки, включая цену, ни с какими потенциальными источниками финансирования", - говорится в иске. По мнению комиссии, заявления Маска привели к сбоям на бирже и нанесли ущерб инвесторам. В связи с этим SEC хочет запретить Маску возглавлять любые компании, чьи акции торгуются на бирже, а также оштрафовать его.',
            'date': '2018-09-27'
        }, 
        {
            'id': 2,
            'title': 'Samsung троллит Apple, раздавая бесплатные смартфоны Galaxy S9 в «яблочной» деревушке',
            'text': 'Компания Samsung продолжает агрессивную маркетинговую кампанию против Apple. После серии высмеивающих Apple рекламных роликов, корейский производитель отправил команду в небольшую деревушку Аппель в голландской провинции Гелдерланд. Дело в том, что Appel по-голландски, означает «яблоко». Samsung троллит Apple, раздавая бесплатные смартфоны Galaxy S9 в «яблочной» деревушке. Там Samsung раздала бесплатные смартфоны Galaxy S9 пятидесяти счастливым жителям деревни с общим населением 312 человек. Акция проводилась с участием 18-летней местной поклонницы Apple по имени Манук. Конечно, по результатам был опубликован небольшое ролик, показывающий, как жители Аппеля получали бесплатные Galaxy S9. На последних кадрах видео показывается дорожный знак с названием деревни и теперь на нём написано не Appel, а Samsung.',
            'date': '2018-09-29'
        }, 
        {
            'id': 3,
            'title': 'У первого в Москве покупателя нового iPhone не оказалось денег',
            'text': 'Первый покупатель нового iPhone в Москве ушел из салона с пустыми руками, передает телеканал Москва 24. Двери магазина re: Store на Тверской улице в центре Москвы открылись в 09: 00, пускали строго по номерам талонов. Первым в очереди за новым гаджетом оказался мужчина Валерий, однако, как оказалось, в салон он зашел только за тем, чтобы посмотреть на новинки Apple. Мужчина признался, что в очереди стоял девятым по счету и очень удивился, что в итоге зашел в магазин первым. По его словам, он купил место в очереди за 50 тысяч рублей в надежде продать его еще дороже, но поскольку идея не удалась, денег на приобретение нового смартфона у него уже не было. "Купил место в очереди за 50 тысяч рублей за пять часов до открытия. Пока стоял здесь, потерял 170 тысяч рублей – они были в кармане", – сказал несостоявшийся покупатель.',
            'date': '2018-09-28'
        }
]
